Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::v1::PipingPort Class Referencefinal
MEP Element Manager
The PipingPort represents a connection point of a pipe segment. More...
#include <MEPPipingPort.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PipingPort:
 Public Member Functions
double  | GetOuterDiameter () const
double  | GetWallThickness () const
FlowDirection  | GetFlowDirection () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< void >  | SetOuterDiameter (double diameter)
Sets the outer diameter of the port.
void  | SetWallThickness (double thickness)
Sets the thickness of the port's wall.
void  | SetFlowDirection (FlowDirection flowDirection)
Sets the flow direction of the port.
 Public Member Functions inherited from ACAPI::MEP::v1::PortBase
bool  | Exists () const
GS::UniString  | GetName () const
Orientation  | GetOrientation () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
API_Coord3D  | GetPosition () const
Domain  | GetDomain () const
API_AttributeIndex  | GetMEPSystem () const
std::optional< UniqueID >  | GetConnectedPortId () const
std::optional< UniqueID >  | GetConnectedMEPElementId () const
UniqueID  | GetMEPElementId () const
bool  | IsPhysicallyConnected () const
Result< bool >  | IsPhysicallyConnectable (const UniqueID &portId) const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< void >  | SetWidth (double width)
Sets the width of the port.
Result< void >  | SetHeight (double height)
Sets the height of the port.
Result< void >  | SetShape (ConnectorShape shape)
Sets the shape of the port.
Result< void >  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< PipingPort >  | Get (const UniqueID &uniqueId)
Returns a PipingPort.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::PortBase
PortBase (std::shared_ptr< Impl::IPortBaseImpl > impl)
Constructs a PortBase with the given port base implementation.
Modifier (PortBase &parent)
Constructs a Modifier with the given port base parent.
 void  | FinalizeModification () override
Finalizes the modifications.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The PipingPort represents a connection point of a pipe segment.
Since
Archicad 27
Example code snippet from Test / New MEP
Take a look at PortBase
Member Function Documentation
◆ Get()
 static Result< PipingPort > ACAPI::MEP::v1::PipingPort::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a PipingPort.
Parameters
uniqueId | The UniqueID of the requested PipingPort.
Returns
If the uniqueId belongs to a PipingPort, returns the object associated to it, otherwise Error.
◆ GetFlowDirection()
 FlowDirection ACAPI::MEP::v1::PipingPort::GetFlowDirection  |  ( |   | ) |   const
Returns
Returns the flow direction of the PipingPort.
◆ GetOuterDiameter()
 double ACAPI::MEP::v1::PipingPort::GetOuterDiameter  |  ( |   | ) |   const
Returns
Returns the outer diameter of the PipingPort.
◆ GetWallThickness()
 double ACAPI::MEP::v1::PipingPort::GetWallThickness  |  ( |   | ) |   const
Returns
Returns the wall thickness of the PipingPort.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::PipingPort::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetFlowDirection()
 void ACAPI::MEP::v1::PipingPort::SetFlowDirection  |  ( |  FlowDirection  |  flowDirection | )
Sets the flow direction of the port.
Parameters
flowDirection | The value to be set.
◆ SetOuterDiameter()
 Result< void > ACAPI::MEP::v1::PipingPort::SetOuterDiameter  |  ( |  double  |  diameter | )
Sets the outer diameter of the port.
Parameters
diameter | The value to be set.
Returns
Returns an error if you are trying to modify a Port of a Branch, otherwise nothing.
◆ SetWallThickness()
 void ACAPI::MEP::v1::PipingPort::SetWallThickness  |  ( |  double  |  thickness | )
Sets the thickness of the port's wall.
Parameters
thickness | The value to be set.